Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet.StraightDimensionSetAttributes.ShortDimension Property
 How short dimensions are shown.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes.ShortDimensionTypes ShortDimension { get; set; }
Public Property ShortDimension As DimensionSetBaseAttributes.ShortDimensionTypes
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes.ShortDimensionTypes
See Also
Reference
StraightDimensionSet.StraightDimensionSetAttributes Class
Tekla.Structures.Drawing Namespace